import 'dart:math';

import '../model/dzongkha.dart';
import '../model/zhebsa.dart';
import '../model/dzongkha_zhebsa.dart';
import 'package:path/path.dart';
import 'package:sqflite/sqflite.dart';

//DatabaseHelper
class DatabaseService {
  // Singleton pattern
  static final DatabaseService _databaseService = DatabaseService._internal();
  factory DatabaseService() => _databaseService;
  DatabaseService._internal();

  static Database? _database;
  Future<Database> get database async {
    if (_database != null) return _database!;
    // Initialize the DB first time it is accessed
    _database = await _initDatabase();
    return _database!;
  }

  Future<Database> _initDatabase() async {
    final databasePath = await getDatabasesPath();

    // Set the path to the database. Note: Using the `join` function from the
    // `path` package is best practice to ensure the path is correctly
    // constructed for each platform.
    final path = join(databasePath, 'zhebsa_assistant.db');

    // Set the version. This executes the onCreate function and provides a
    // path to perform database upgrades and downgrades.
    return await openDatabase(
      path,
      onCreate: _onCreate,
      version: 1,
      onConfigure: (db) async => await db.execute('PRAGMA foreign_keys = ON'),
    );
  }

  // When the database is first created, create a table to store dzongkha
  // and a table to store zhebsa.
  Future<void> _onCreate(Database db, int version) async {
    // Run the CREATE {dzongkha} TABLE statement on the database.
    await db.execute(
      '''CREATE TABLE Dzongkha(
        dId INTEGER NOT NULL PRIMARY KEY AUTOINCREMENT, 
        dWord TEXT NOT NULL UNIQUE, 
        dPhrase TEXT, 
        dHistory TEXT, 
        dFavourite TEXT, 
        dUpdateTime TEXT)''',
    );
    // Run the CREATE {zhebsa} TABLE statement on the database.
    await db.execute(
      '''CREATE TABLE Zhebsa(
        zId INTEGER NOT NULL PRIMARY KEY AUTOINCREMENT, 
        zWord TEXT NOT NULL UNIQUE, 
        zPhrase TEXT, 
        zPronunciation TEXT, 
        zHistory TEXT, 
        zFavourite TEXT, 
        zUpdateTime TEXT)''',
    );

    // Run the CREATE {dzongkha_zhebsa} TABLE statement on the database.
    await db.execute(
      'CREATE TABLE DzongkhaZhebsa(DzongkhadId INTEGER NOT NULL, ZhebsazId INTEGER NOT NULL, updateTime  TEXT, PRIMARY KEY (DzongkhadId, ZhebsazId), FOREIGN KEY(DzongkhadId) REFERENCES Dzongkha(dId) ON DELETE SET NULL, FOREIGN KEY(ZhebsazId) REFERENCES Zhebsa(zId) ON DELETE SET NULL)',
    );

    await db.execute(
      '''CREATE TABLE ZhebsaWordOfDay(
        wodID INTEGER NOT NULL,
        wodDay TEXT)''',
    );

    //Insert raw data to database
    /* var dt = DateTime.now();
    var dtStr = dt.toIso8601String(); */
    // dt = DateTime.tryParse(dtStr)!;//DATE_TIME

    /* var dtInt = dt.millisecondsSinceEpoch;////CURRENT_TIMESTAMP
    dt = DateTime.fromMillisecondsSinceEpoch(dtInt);
 */
    await db
        .rawInsert('''INSERT INTO Dzongkha(dId,dWord,dPhrase,dUpdateTime) VALUES
 (1,'ཀ་ར་གཏང་།','མི་ཚུ་ཁྱིམ་ཀ་ར་གཏང་དེས།','2022-05-18T17:44:56.587')
,(2,'ཀླད་པ།','མི་གི་ཀླདཔ་རུད་ནི་ཟེར་ག་ཏེ་འོང་ནི།','2022-05-18T17:44:56.587')
,(3,'དཀར་མེ།','ལྷ་ཁང་ནང་དཀར་མེ་ཕུལ་དགོ།','2022-05-18T17:44:56.587')
,(4,'དཀར་ཡོལ།','དཀར་ཡོལ་ཆགས་ཡར་སོ་ནུག།','2022-05-18T17:44:56.587')
,(5,'བཀབ་ནེ།','བཀབ་ནེ་བཀབ་མི་འདི་ཁུངས་ཡོད།','2022-05-18T17:44:56.587')
,(6,'བཀའ་རྒྱ་ཐོབ།','ཡིག་ཚང་བཀའ་རྒྱ་ཐོབ་ཅི་སྨ་རེ།','2022-05-18T17:44:56.587')
,(7,'རྐང་ཁྲི།','རྐང་ཁྲི་གུ་སྡོད་དེ་བློ་སླབ།','2022-05-18T17:44:56.587')
,(8,'སྡོད་ཁྲི།','སློབ་ཕྲུག་ཚུ་སྡོད་ཁྲི་གུ་སྡོད་མ་བཅུག་པས།','2022-05-18T17:44:56.587')
,(9,'རྐང་རྗེན།','རྐང་རྗེན་སྦེ་འགྱོ་བ་ཅིན་ རྐང་མར་རྩང་འཛུལ་འོང་།','2022-05-18T17:44:56.587')
,(10,'རྐང་རྗེས།','མིའི་རྐང་རྗེས་འདི་མིག་ཏེ་གིས་མཐོང་མས།','2022-05-18T17:44:56.587')
,(11,'རྐང་རྟིང་།','བུམོ་གི་རྐང་རྟིང་རིང་རང་རིང་པས།','2022-05-18T17:44:56.587')
,(12,'རྐང་སྟེགས།','རྐང་སྟེགས་གུ་འཛེགས་སྡོད་ནུག།','2022-05-18T17:44:56.587')
,(13,'རྐང༌སྟོང༌།','རྐང་སྟོང་སྦེ་འགྱོ་སྟེ་རྩང་འཛུལ་ཏེ་ལམ་འགྱོ་མ་ཚུགས།','2022-05-18T17:44:56.587')
,(14,'རྐང་ཐང་།','རྐང་ཐང་སྦེ་འགྱོ་རུང་ལྷོད་ཚུགས།','2022-05-18T17:44:56.587')
,(15,'རྐང་མཐིལ།','རྐང་མཐིལ་གུ་གླངམོ་ཆེའི་པར་འདུག།','2022-05-18T17:44:56.587')
,(16,'རྐང་གདན།','རྐང་གདན་ཡོད་རུང་ གཞན་ཁ་ལས་སོང་ནུག།','2022-05-18T17:44:56.587')
,(17,'རྐང་གདུབ།','མི་ཚུ་ལུ་རྐང་གདུབ་རེ་རེ་སྦེ་བཙུགས་སྡོད་སར་མཐོང་ཅི།','2022-05-18T17:44:56.587')
,(18,'སྐད་ཧན།','བུ་མོའི་སྐད་འདི་སྐྱེས་པའི་རྣ་བར་ཧན་རང་ཧན་པས།','2022-05-18T17:44:56.587')
,(19,'སྐལཝ།','མི་ཤི་མི་འདི་ལོག་སྐལཝ་ག་ཏེ་ལན་ཡི་ག་མི་ཤེས།','2022-05-18T17:44:56.587')
,(20,'སྐེ།','གསུང་སྐུད་འདི་སྐེ་ལུ་བཏགས་དགོ།','2022-05-18T17:44:56.587')
,(21,'སྐེ་རྒྱན།','བུམོ་ཚུ་སྐེ་རྒྱན་བཏགསཔ་ད་རང་ལེགས་པས།','2022-05-18T17:44:56.587')
,(22,'སྐེ་དར།','གོ་གནས་མ་ཐོབ་རུང་ སྐེ་དར་གནང་དེས།','2022-05-18T17:44:56.587')
,(23,'སྐོར་ར།','ལྷ་ཁང་སྐོར་ར་རྐྱབ་སྟེ་སྡོད་ནུག།','2022-05-18T17:44:56.587')
,(24,'སྐྱ།','སྐྱ་གསེརཔོ་ཡོད་ཚད་ཅིགཔ་ཕྱི་ལསཔ་མེན།','2022-05-18T17:44:56.587')
,(25,'སྐྱ་བཏོག','སློབ་ཕྲུག་ཚུ་སྐྱ་བཏོག་པ་ཅིན་ཧིང་སངས་ས་མཐོངམ་མས།','2022-05-18T17:44:56.587')
,(26,'སྐྱེ།','ཨ་ལོ་སྐྱེ་ནི་འདི་ཁྲིམས་མེན།','2022-05-18T17:44:56.587')
,(27,'སྐྱེ་སྐར།','ཁོ་གི་སྐྱེ་སྐར་གྱི་ཉིནམ་ལུ་སྨོན་ལམ་བཏབ་ནུག།','2022-05-18T17:44:56.587')
,(28,'སྐྱེ༌བའི༌ཉིནམ།','ད་རིས་ངེའི་སྐྱེ་བའི་ཉིནམ་ཨིན།','2022-05-18T17:44:56.587')
,(29,'སྐྱེ་བ།','ངེའི་ཆ་རོགས་གྱོངས་མི་འདི་གི་སྐྱེ་བ་འདི་ཁ་ཨིན་མས།','2022-05-18T17:44:56.587')
,(30,'སྐྱེ་བ་ལེན།','ད་ལྟོ་མི་སྦེ་སྐྱེ་བ་ལེན་ཏེ་ཡོད།','2022-05-18T17:44:56.587')
,(31,'སྐྱེ་ཚེས།',NULL,'2022-05-18T17:44:56.587')
,(32,'སྐྱེ་ཟུག',NULL,'2022-05-18T17:44:56.587')
,(33,'སྐྱེ་ཟླ།',NULL,'2022-05-18T17:44:56.587')
,(34,'ཁ་ངལ།',NULL,'2022-05-18T17:44:56.587')
,(35,'ཁ་ངོམས།',NULL,'2022-05-18T17:44:56.588')
,(36,'ཁ་ཆད།',NULL,'2022-05-18T17:44:56.588')
,(37,'ཁ་ཆུ།',NULL,'2022-05-18T17:44:56.588')
,(38,'ཁ་ཆེམས།',NULL,'2022-05-18T17:44:56.588')
,(39,'ཁ་མཆུ།',NULL,'2022-05-18T17:44:56.588')
,(40,'ཁ་འཆམ།',NULL,'2022-05-18T17:44:56.588')
,(41,'ཁ་འཇམ།',NULL,'2022-05-18T17:44:56.588')
,(42,'ཁ་ཉུང་།',NULL,'2022-05-18T17:44:56.588')
,(43,'ཁ་ཏ།',NULL,'2022-05-18T17:44:56.588')
,(44,'ཁ་སྟོངམ།',NULL,'2022-05-18T17:44:56.588')
,(45,'ཁ་ཐུན།',NULL,'2022-05-18T17:44:56.588')
,(46,'ཁ་ཐོག',NULL,'2022-05-18T17:44:56.588')
,(47,'ཁ་མཐུན།',NULL,'2022-05-18T17:44:56.588')
,(48,'ཁ་འཐེན།',NULL,'2022-05-18T17:44:56.588')
,(49,'ཁ་དིགཔ།',NULL,'2022-05-18T17:44:56.588')
,(50,'ཁ་རས།',NULL,'2022-05-18T17:44:56.588')
,(51,'ཁ་ལན།',NULL,'2022-05-18T17:44:56.588')
,(52,'ཁ་ལན་འཇལ།',NULL,'2022-05-18T17:44:56.588')
,(53,'ཁ་ཤུགས།',NULL,'2022-05-18T17:44:56.588')
,(54,'ཁ་བཤལ།',NULL,'2022-05-18T17:44:56.588')
,(55,'ཁ་སྲུང་།',NULL,'2022-05-18T17:44:56.588')
,(56,'ཁམས་འདྲི།',NULL,'2022-05-18T17:44:56.588')
,(57,'ཁས་བླངས།',NULL,'2022-05-18T17:44:56.588')
,(58,'ཁོད་སྟོད།',NULL,'2022-05-18T17:44:56.588')
,(59,'ཁྱབ་བསྒྲགས།',NULL,'2022-05-18T17:44:56.588')
,(60,'ཁྱིམ།',NULL,'2022-05-18T17:44:56.588')
,(61,'ཁྱོད།',NULL,'2022-05-18T17:44:56.588')
,(62,'ཁྱོད་ཆ་ཁྱབ།',NULL,'2022-05-18T17:44:56.588')
,(63,'ཁྲག',NULL,'2022-05-18T17:44:56.588')
,(64,'གྱི་ཤུབས།',NULL,'2022-05-18T17:44:56.588')
,(65,'གྱོང་རྒུད།',NULL,'2022-05-18T17:44:56.588')
,(66,'གྱོངས།',NULL,'2022-05-18T17:44:56.588')
,(67,'གྲིབ།',NULL,'2022-05-18T17:44:56.588')
,(68,'གྲུ།',NULL,'2022-05-18T17:44:56.588')
,(69,'གྲྭ་ཆས།',NULL,'2022-05-18T17:44:56.588')
,(70,'གླ༌ཆ།',NULL,'2022-05-18T17:44:56.588')
,(71,'གླིང་བུ།',NULL,'2022-05-18T17:44:56.588')
,(72,'གླུ།',NULL,'2022-05-18T17:44:56.588')
,(73,'གླུ་གཞས།',NULL,'2022-05-18T17:44:56.588')
,(74,'གླུད།',NULL,'2022-05-18T17:44:56.588')
,(75,'གློ།',NULL,'2022-05-18T17:44:56.588')
,(76,'གློ་ཚིལ།',NULL,'2022-05-18T17:44:56.588')
,(77,'དགའ།',NULL,'2022-05-18T17:44:56.588')
,(78,'དགའ་ཆང་།',NULL,'2022-05-18T17:44:56.588')
,(79,'དགའ་སྟོན།',NULL,'2022-05-18T17:44:56.588')
,(80,'མགོ་རྒྱན།',NULL,'2022-05-18T17:44:56.588')
,(81,'མགོ་ཅན།',NULL,'2022-05-18T17:44:56.588')
,(82,'མགོ་ཡིག',NULL,'2022-05-18T17:44:56.588')
,(83,'མགོ་རས།',NULL,'2022-05-18T17:44:56.588')
,(84,'མགྱོནམོ།',NULL,'2022-05-18T17:44:56.588')
,(85,'མགྱོནམོ་གཙོ་བོ།',NULL,'2022-05-18T17:44:56.588')
,(86,'འགན།',NULL,'2022-05-18T17:44:56.588')
,(87,'འགན་ཁག',NULL,'2022-05-18T17:44:56.588')
,(88,'འགོ་ཁྱིད་མི།',NULL,'2022-05-18T17:44:56.588')
,(89,'འགོ་ཁྲིད།',NULL,'2022-05-18T17:44:56.588')
,(90,'འགོ་ཁྲིད་ཞལ་མཛོམས།',NULL,'2022-05-18T17:44:56.588')
,(91,'འགོ་འདྲེན།',NULL,'2022-05-18T17:44:56.588')
,(92,'འགོ་བཙུགས།',NULL,'2022-05-18T17:44:56.588')
,(93,'འགོ་འཛིན།',NULL,'2022-05-18T17:44:56.589')
,(94,'འགྱོ།',NULL,'2022-05-18T17:44:56.589')
,(95,'འགྱོད་པ།',NULL,'2022-05-18T17:44:56.589')
,(96,'འགྲམ་པ།',NULL,'2022-05-18T17:44:56.589')
,(97,'ངལ་གསོ།',NULL,'2022-05-18T17:44:56.589')
,(98,'ངོ༌བསྒང༌།',NULL,'2022-05-18T17:44:56.589')
,(99,'ངོ་པར།',NULL,'2022-05-18T17:44:56.589')
,(100,'ངོ་མ།',NULL,'2022-05-18T17:44:56.589')
,(101,'ངོ་ཚ།',NULL,'2022-05-18T17:44:56.589')
,(102,'ངོ་ཚབ།',NULL,'2022-05-18T17:44:56.589')
,(103,'ངོ་འཛུམ།',NULL,'2022-05-18T17:44:56.589')
,(104,'ངོ་ཤེས།',NULL,'2022-05-18T17:44:56.589')
,(105,'དངུལ།',NULL,'2022-05-18T17:44:56.589')
,(106,'དངོས།',NULL,'2022-05-18T17:44:56.589')
,(107,'མངལ།',NULL,'2022-05-18T17:44:56.589')
,(108,'སྔགས།',NULL,'2022-05-18T17:44:56.589')
,(109,'སྔུ།',NULL,'2022-05-18T17:44:56.589')
,(110,'ཅ་ལ།',NULL,'2022-05-18T17:44:56.589')
,(111,'ཅན་སྟེགས།',NULL,'2022-05-18T17:44:56.589')
,(112,'བརྗེད།',NULL,'2022-05-18T17:44:56.589')
,(113,'བརྗེད་ཐོ།',NULL,'2022-05-18T17:44:56.589')
,(114,'ཉམས།',NULL,'2022-05-18T17:44:56.589')
,(115,'ཉལ།',NULL,'2022-05-18T17:44:56.589')
,(116,'ཉལ་ཁང་།',NULL,'2022-05-18T17:44:56.589')
,(117,'ཉལ་ཁྲི།',NULL,'2022-05-18T17:44:56.589')
,(118,'ཉལ་ཆས།',NULL,'2022-05-18T17:44:56.589')
,(119,'ཉལ་གདན།',NULL,'2022-05-18T17:44:56.589')
,(120,'ཉལ་ཤག',NULL,'2022-05-18T17:44:56.589')
,(121,'ཉལ་ས།',NULL,'2022-05-18T17:44:56.589')
,(122,'ཉི་མའི་ལྟོ།',NULL,'2022-05-18T17:44:56.589')
,(123,'ཉིད།',NULL,'2022-05-18T17:44:56.589')
,(124,'ཉིན་གདུགས།',NULL,'2022-05-18T17:44:56.589')
,(125,'ཉིན་ཞག',NULL,'2022-05-18T17:44:56.589')
,(126,'ཉེཝ།',NULL,'2022-05-18T17:44:56.589')
,(127,'ཉེ་ཚན།',NULL,'2022-05-18T17:44:56.589')
,(128,'རྟ་ར།',NULL,'2022-05-18T17:44:56.589')
,(129,'རྟས་ཐག',NULL,'2022-05-18T17:44:56.589')
,(130,'ལྟ།',NULL,'2022-05-18T17:44:56.589')
,(131,'ལྟ་སྐོར།',NULL,'2022-05-18T17:44:56.589')
,(132,'ལྟ་རྟོག',NULL,'2022-05-18T17:44:56.589')
,(133,'ལྟ་ཞིབ།',NULL,'2022-05-18T17:44:56.589')
,(134,'ལྟོ།',NULL,'2022-05-18T17:44:56.589')
,(135,'ལྟོ་གྲོལ།',NULL,'2022-05-18T17:44:56.589')
,(136,'ལྟོ་རྒྱགས།',NULL,'2022-05-18T17:44:56.589')
,(137,'ལྟོ་དྲང་།',NULL,'2022-05-18T17:44:56.589')
,(138,'ལྟོ་རས།',NULL,'2022-05-18T17:44:56.589')
,(139,'ལྟོ་ལྷག',NULL,'2022-05-18T17:44:56.589')
,(140,'ལྟོཝ་བཀྱེས།',NULL,'2022-05-18T17:44:56.589')
,(144,'འཐུང་ཆང་།',NULL,'2022-05-18T17:44:56.589')
,(145,'འཐུང་ཆུ།',NULL,'2022-05-18T17:44:56.589')
,(146,'དརཝ།',NULL,'2022-05-18T17:44:56.589')
,(147,'དུག',NULL,'2022-05-18T17:44:56.589')
,(148,'དུས་འཕོས།',NULL,'2022-05-18T17:44:56.589')
,(149,'དོགས་པ།',NULL,'2022-05-18T17:44:56.589')
,(150,'དོན་ཧིང་།',NULL,'2022-05-18T17:44:56.589')
,(151,'དོརམ།',NULL,'2022-05-18T17:44:56.589')
,(152,'དྲག་དྲགམ།',NULL,'2022-05-18T17:44:56.589')
,(153,'དྲིན།',NULL,'2022-05-18T17:44:56.589')
,(154,'གདོང་།',NULL,'2022-05-18T18:22:43.462')
,(155,'གདོང་ཁ།',NULL,'2022-05-18T17:44:56.589')
,(156,'ན།',NULL,'2022-05-18T17:44:56.589')
,(157,'ནང་དོག',NULL,'2022-05-18T17:44:56.589')
,(159,'ནད།',NULL,'2022-05-18T17:44:56.589')
,(160,'ནད་དྲག',NULL,'2022-05-18T17:44:56.589')
,(161,'ནད་མེད།',NULL,'2022-05-18T17:44:56.589')
,(162,'ནད་གཞི།',NULL,'2022-05-18T17:44:56.589')
,(163,'ནུམོ་དང་ནོ་གཅུང་།',NULL,'2022-05-18T17:44:56.589')
,(164,'གནང་བ་གྲོལ།',NULL,'2022-05-18T17:44:56.589')
,(165,'མནའ།',NULL,'2022-05-18T17:44:56.590')
,(166,'མནོ་དོན།',NULL,'2022-05-18T17:44:56.590')
,(167,'མནོ་བསམ།',NULL,'2022-05-18T17:44:56.590')
,(168,'རྣ་རྒྱན།',NULL,'2022-05-18T17:44:56.590')
,(169,'རྣ་རྒྱུན།',NULL,'2022-05-18T17:44:56.590')
,(170,'ཕ་བུ།',NULL,'2022-05-18T17:44:56.590')
,(171,'ཕ་མ།',NULL,'2022-05-18T17:44:56.590')
,(172,'ཕ་ཡུལ།',NULL,'2022-05-18T17:44:56.590')
,(173,'ཕུངམོ།',NULL,'2022-05-18T17:44:56.590')
,(174,'ཕོགས།',NULL,'2022-05-18T17:44:56.590')
,(175,'ཕོཝ།',NULL,'2022-05-18T17:44:56.590')
,(176,'ཕོརཔ།',NULL,'2022-05-18T17:44:56.590')
,(177,'ཕྱི་རུའི་ལྟོ།',NULL,'2022-05-18T17:44:56.590')
,(178,'ཕྱེ།',NULL,'2022-05-18T17:44:56.590')
,(179,'ཕྱེངམ།',NULL,'2022-05-18T17:44:56.590')
,(180,'འཕྱད།',NULL,'2022-05-18T17:44:56.590')
,(181,'འབགཔ།',NULL,'2022-05-18T17:44:56.590')
,(182,'འབངས།',NULL,'2022-05-18T17:44:56.590')
,(183,'འབད་ཐངས།',NULL,'2022-05-18T17:44:56.590')
,(184,'འབད་འཕྲོ།',NULL,'2022-05-18T17:44:56.590')
,(185,'འབད་མི།',NULL,'2022-05-18T17:44:56.590')
,(186,'འབད་གཞག',NULL,'2022-05-18T17:44:56.590')
,(187,'འབད་ཤུལ།',NULL,'2022-05-18T17:44:56.590');
''');

    await db.rawInsert(
        '''INSERT INTO Zhebsa(zId,zWord,zPhrase,zPronunciation,zUpdateTime) VALUES
 (1,'སྐུ་དཀར་གསོལ།','ད་རིས་གཡུས་ཁའི་མི་ཚུ་གིས་མཆོད་རྟེན་སྐུ་དཀར་གསོལ་དེས།',NULL,'2022-05-18T17:51:15.871')
,(2,'དབུ་ཀླད།','འདི་སངས་རྒྱས་ཀྱི་དབུ་ཀླད་ཨིན།','F000002.mp3','2022-05-18T17:51:15.871')
,(3,'མཆོད་མེ།','ལྷ་ཁང་ནང་ལུ་མཆོད་མེ་ཕུལ་བ་ཅིན་ རང་བསོད་ནམས་བསག་འོང་།','F000003.mp3','2022-05-18T17:51:15.871')
,(4,'ཞལ་དཀར།','བླམ་ལུ་ཞལ་དཀར་ནང་ཨོམ་བླུགས་ཏེ་དྲངས།',NULL,'2022-05-18T17:51:15.871')
,(5,'སྐུ་གཟན།','བློན་པོའི་སྐུ་གཟན་འདི་ཁ་དོག་ལི་ཝང་ཨིན།','F000005.mp3','2022-05-18T17:51:15.871')
,(6,'ན༌བཟའ།','སློབ་དཔོན་གྱི་ན་བཟའ་འདི་འཇའ་ཆི་ཆི་འདུག།','F000006.mp3','2022-05-18T17:51:15.871')
,(7,'བཀའ་རྒྱ༌ཕེབས།','ཡིག་ཚང་ལས་བཀའ་རྒྱ་ཕེབས་ཏེ་ཡོད།','F000007.mp3','2022-05-18T17:51:15.871')
,(8,'བཞུགས་ཁྲི།','རྒྱལ་པོའི་བཞུགས་ཁྲི་གུ་བླམ་གིས་བཞུགས་ཆི་ནུག།',NULL,'2022-05-18T17:51:15.871')
,(9,'ཞབས་རྗེན།','དང་ཕུའི་དུས་ལུ་སྐུ་ཆེནམོ་ཚུ་ཡང་ ཞབས་རྗེན་སྦེ་འབྱོན་དགོ་དོ་ཡོདཔ་ཨིན་པས།','F000009.mp3','2022-05-18T17:51:15.871')
,(10,'ཞབས་རྗེས།','འབྲུག་ལུ་ཨོ་རྒྱན་གུ་རུ་རིན་པོ་ཆེའི་ཞབས་རྗེས་ལེ་ཤ་མཇལ་ནི་ཡོད།','F000010.mp3','2022-05-18T17:51:15.871')
,(11,'ཞབས་རྟིང་།','སློབ་དཔོན་གྱི་ཞབས་རྟིང་གུར་རྨ་འདུག།','F000011.mp3','2022-05-18T17:51:15.871')
,(12,'ཞབས་སྟེགས།',NULL,'F000012.mp3','2022-05-18T17:51:15.871')
,(13,'ཞབས་སྟོང།','དང་ཕུའི་བླམ་ཚུ་ཞབས་སྟོང་སྦེ་བྱོན་པའི་ལོ་རྒྱུས་འདུག།','F000013.mp3','2022-05-18T17:51:15.871')
,(14,'ཞབས་ཐང་།','སྤྲུལ་སྐུ་ཞབས་ཐང་སྦེ་འབྱོན་དེས།','F000014.mp3','2022-05-18T17:51:15.871')
,(15,'ཞབས་མཐིལ།','བླ་མའི་ཞབས་མཐིལ་དཀརཔོ་སྦེ་འདུག།','F000015.mp3','2022-05-18T17:51:15.871')
,(16,'ཞབས་གདན།','དགེ་སློང་ཚུ་ཞབས་གདན་གུ་ལས་འབྱོན་དེས།','F000016.mp3','2022-05-18T17:51:15.871')
,(17,'ཞབས་གདུབ།','དང་ཕུའི་ཕམ་ཚུ་ལུ་ཕྱག་གདུབ་དང་ཞབས་གདུབ་ལེ་ཤ་འོང་།','F000017.mp3','2022-05-18T17:51:15.871')
,(18,'གསུང་སྙན།','ལྷ་མོའི་གསུང་འདི་སྙན་པས།',NULL,'2022-05-18T17:51:15.871')
,(19,'སྐུ་སྐལ།','ཚོགས་འདི་བླ་མའི་སྐུ་སྐལ་ཨིན།',NULL,'2022-05-18T17:51:15.871')
,(20,'མགུལ།','སངས་རྒྱས་ཀྱི་མགུལ་འདི་བུམ་པ་གི་དབྱིབས་བཟུམ་སྦེ་འདུག།','F000020.mp3','2022-05-18T17:51:15.871')
,(21,'མགུལ་རྒྱན།','སྐུའི་མགུལ་རྒྱན་འདི་རྒྱུ་གསེར་གྱིས་བཟོ་བཟོཝ་ཅིག་ཨིན་མས།','F000021.mp3','2022-05-18T17:51:15.871')
,(22,'མགུལ་དར།','རྒཔོ་ཆ་ཁྱབ་ད་རིས་མགུལ་དར་ཞུ་བར་འགྱོ་དེས།','F000022.mp3','2022-05-18T17:51:15.871')
,(23,'ཞབས་སྐོར།','དྲག་ཤོས་ཞབས་སྐོར་ལུ་བྱོན་ནུག།','F000023.mp3','2022-05-18T17:51:15.871')
,(24,'དབུ་སྐྲ།','ཁོ་ལུ་གྲུབ་ཐོབ་ཀྱི་དབུ་སྐྲ་ཅིག་འདུག།','F000024.mp3','2022-05-18T17:51:15.871')
,(25,'དབུ་སྐྲ་བསིལ།','ད་རིས་དགེ་སློང་ཚུ་དབུ་སྐྲ་བསིལ་དེས།',NULL,'2022-05-18T17:51:15.872')
,(26,'འཁྲུངས།','བླ་མའི་ཡང་སྲིད་འདི་ན་ཧིང་སྐུ་འཁྲུངས་ནུག།','F000026.mp3','2022-05-18T17:51:15.872')
,(27,'འཁྲུངས་སྐར།','རྒྱལ་པའི་འཁྲུངས་སྐར་དུས་ཆེན་ལོ་ཨ་རྟག་རང་བརྩི་སྲུང་ཞུཝ་ཨིན།','F000027.mp3','2022-05-18T17:51:15.872')
,(28,'སྐུ་སྐྱེ།','བླ་མའི་སྐུ་སྐྱེ་འདི་བླམ་ཁོ་རའི་ཚ་བོ་ཨིན།','F000028.mp3','2022-05-18T17:51:15.872')
,(29,'ཡང་སྲིད།','བླ་མའི་ཡང་སྲིད་འདི་གཟི་བརྗིད་ཆེ་ཏོག་ཏོ་འདུག།','F000029.mp3','2022-05-18T17:51:15.872')
,(30,'སྐུ་སྐྱེ་བཞེས།','སློབ་དཔོན་འདི་ཧེ་མ་མི་ཕྱུགཔོ་ཅིག་གི་སྐུ་སྐྱེ་བཞེས་ཏེ་བཞུགས་ནུག།','F000030.mp3','2022-05-18T17:51:15.872')
,(31,'འཁྲུངས་ཚེས།','ཞབས་དྲུང་རིན་པོ་ཆེ་མཆོག་གི་འཁྲུངས་ཚེས་ནམ་སྨོ?','F000031.mp3','2022-05-18T17:51:15.872')
,(32,'འཁྲུངས་ཟུག','བླ་མའི་ཡུམ་འདི་འཁྲུངས་ཟུག་གིས་སྦེ་བཤགས་སོ་ནུག།','F000032.mp3','2022-05-18T17:51:15.872')
,(33,'འཁྲུངས་ཟླ།','མི་དབང་མངའ་བདག་རིན་པོ་ཆེ་མཆོག་གི་འཁྲུངས་ཟླ་ནམ་སྨོ?',NULL,'2022-05-18T17:51:15.872')
,(34,'ཞལ་ངལ།','མཁན་པོ་མཆོག་ཉིནམ་གཅིག་ར་ཆོས་གསུངས་ནི་འདི་གིས་ཞལ་ངལ་ཆིཔ་འོང་།',NULL,'2022-05-18T17:51:15.872')
,(35,'ཞལ་ངོམས།','མཁས་པ་ཚུ་ཡོན་ཏན་གྱི་ཞལ་ངོམས་ནི་མེདཔ་ཨིན།',NULL,'2022-05-18T17:51:15.872')
,(36,'ཞལ་ཆད།','ལཱ་འདི་སློབ་དཔོན་གིས་མཛད་ནི་སྦེ་ཞལ་ཆད་གནང་ཡི།',NULL,'2022-05-18T17:51:15.872')
,(37,'ཞལ་ཆུ།','འགོ་དཔོན་གྱི་ཞལ་ལས་ཞལ་ཆུ་འཛག་དེས།',NULL,'2022-05-18T17:51:15.872')
,(38,'ཞལ་ཆེམས།','བླམ་ཞིང་དུ་མ་ཕེབས་པའི་ཧེ་མ་སློབ་མ་ཚུ་ལུ་ཞལ་ཆེམས་གནང་ནུག།',NULL,'2022-05-18T17:51:15.872')
,(39,'ཞལ་མཆུ།','ཨ་ཞེ་གི་ཞལ་མཆུ་འདི་ག་ནི་བ་ལེགས་པས།',NULL,'2022-05-18T17:51:15.872')
,(40,'ཞལ༌འཆམ།','མོ་གིས་ཞུ་མི་ལུ་ག་ར་གིས་ཞལ་འཆམ་གནང་ཡི།',NULL,'2022-05-18T17:51:15.872')
,(41,'ཞལ་འཇམ།','བླམ་གིས་ཞལ་འཇམ་པའི་སྒོ་ལས་ཆོས་གནང་ཡི།',NULL,'2022-05-18T17:51:15.872')
,(42,'ཞལ་ཉུང།','མཁན་པོ་འདི་ཐུགས་བཟང་པའི་གུར་ཞལ་ཉུང་པས།',NULL,'2022-05-18T17:51:15.872')
,(43,'ཞལ༌ཏ།','རྒྱལ་པོའི་མི་སེར་ལུ་གནང་མི་ཞལ་ཏ་འདི་གསེར་ལས་ཡང་རིན་ཐང་ཆེ་བས།',NULL,'2022-05-18T17:51:15.872')
,(44,'ཞལ་སྟོངམ།','སློབ་དཔོན་འདི་ག་ནི་ཡང་མ་བཞེས་པར་ཞལ་སྟོངམ་སྦེ་བྱོན་སོ་ཡི།',NULL,'2022-05-18T17:51:15.872')
,(45,'ཞལ་ཐུན།','ཨ་ཞང་མཚམས་པ་འདི་ཞལ་ཐུན་གནང་ཏེ་ར་བཞུགསཔ་ཨིན།',NULL,'2022-05-18T17:51:15.872')
,(46,'ཞལ་ཐོག།','དྲུང་ཆེན་གྱིས་གསུང་བཤད་འདི་འདི་ཞལ་ཐོག་ལས་གནང་ཡི།',NULL,'2022-05-18T17:51:15.872')
,(47,'ཞལ་མཐུན།','བླམ་དང་སློབ་དཔོན་ཚུ་ག་ར་ཞལ་མཐུན་ནུག།',NULL,'2022-05-18T17:51:15.872')
,(48,'གསུང༌འཕྲིན།','བླམ་གིས་ཁོ་རའི་སློབ་མ་ཚུ་ལུ་གསུང་འཕྲིན་གནང་དེས།','F000048.mp3','2022-05-18T17:51:15.872')
,(49,'ཞལ་དིགཔ།','དྲག་ཤོས་འདི་དུམ་གྲ་ཅིག་ཞལ་དིགཔ་མས།',NULL,'2022-05-18T17:51:15.872')
,(50,'ཞལ་རས།','བློན་ཆེན་གྱིས་དུས་ནམ་ར་ཨིན་རུང་ཞལ་རས་བཞེས་དགོཔ་སྦེ་གསུངས་ཏེ་ཡོདཔ་ཨིན།',NULL,'2022-05-18T17:51:15.872')
,(51,'གསུང་ལན།','བླ་མའི་གསུང་ལན་མཁན་པོ་གིས་ཞུ་ཡི།','F000051.mp3','2022-05-18T17:51:15.872')
,(52,'ཞལ་ལོག་ཞུ།','རང་གི་གོངམ་ལུ་ཞལ་ལོག་ཞུ་མི་རུང་།','F000052.mp3','2022-05-18T17:51:15.872')
,(53,'ཞལ་ཤུགས།','དྲག་ཤོས་ཀྱི་ཞལ་ཤུགས་ལས་བརྟེན་ལས་གཡོགཔ་ག་ར་སེམས་ཕམ་ནུག།',NULL,'2022-05-18T17:51:15.872')
,(54,'ཞལ་བཤལ།','སློབ་དཔོན་ལུ་ཞལ་བཤལ་ནི་གི་ཆུ་ཅིག་ཕུལ་ཞིག།',NULL,'2022-05-18T17:51:15.872')
,(55,'ཞལ་སྲུང་།','སྨན་ཁང་ནང་ལས་ཞལ་སྲུང་དགོཔ་སྦེ་ཞུ་ནུག།',NULL,'2022-05-18T17:51:15.872')
,(56,'སྙུན་འདྲི།','སློབ་དཔོན་ལུ་སྙུན་འདྲི་ཞུ་དགོ།',NULL,'2022-05-18T17:51:15.872')
,(57,'ཞལ་བཞེས།','སྤྲུལ་སྐུ་གིས་ཆོས་བཤད་གནང་ནི་སྦེ་ཞལ་བཞེས་གནང་ཡི།',NULL,'2022-05-18T17:51:15.872')
,(58,'སྐུ་སྟོད།','བླམ་འདི་སྐུ་སྟོད་སེརཔོ་ཅིག་བཞེས་ཏེ་ཞུ་ནུག།','F000058.mp3','2022-05-18T17:51:15.872')
,(59,'བཀའ་ཁྱབ།','གཞུང་ལས་དམིགས་བསལ་གྱིས་བཀའ་ཁྱབ་གནང་སྟེ་ཡོད།','F000059.mp3','2022-05-18T17:51:15.872')
,(60,'གཟིམ་ཅུང་།','མགྱོནམ་བཞུགས་སའི་གཟིམ་ཅུང་གྲ་སྒྲིག་སྦེ་བཞག།','F000060.mp3','2022-05-18T17:51:15.872')
,(61,'སྐུ་ཉིད།','སྐུ་ཉིད་ཀྱི་མཛད་པའི་གསུང་རྩོམ་འདི་ཧ་ལས་སི་སི་འདུག།',NULL,'2022-05-18T17:51:15.872')
,(62,'ཁྱེད།','ཁྱེད་ཀྱི་མཛད་པ་དར་ཞིང་རྒྱས་པར་ཤོག།',NULL,'2022-05-18T17:51:15.872')
,(63,'སྐུ་ཁྲག།','བླ་མའི་སྐུ་ཁྲག་ལས་རིང་བསྲེལ་ལེ་ཤ་བྱོན་ནུག།','F000063.mp3','2022-05-18T17:51:15.872')
,(64,'སྐུ་མཚལ།','བླ་མའི་སྐུ་མཚལ་ལས་བཞེངས་པའི་ཐང་ཀ་ཅིག་ནང་རྟེན་སྦེ་འདུག།',NULL,'2022-05-18T17:51:15.872')
,(65,'ཤན་ཤུབས།','དྲག་ཤོས་ཀྱི་ཤན་ཤུབས་འདི་དངུལ་གྱིས་བཟོ་བཟོཝ་ཨིན་པས།','F000065.mp3','2022-05-18T17:51:15.872')
,(66,'སྐུ་གྱོང་།','སློབ་དཔོན་ལུ་སྐུ་གྱོང་སྦོམ་ར་བཀལ་ཡི།','F000066.mp3','2022-05-18T17:51:15.872')
,(67,'གཤགས།','འགོ་དཔོན་ཆ་ཁྱབ་གཤགས་རྐྱབ་དེས།','F000067.mp3','2022-05-18T17:51:15.872')
,(68,'སྐུ་གྲིབ།','རིན་པོ་ཆེ་ལུ་སྐུ་གྲིབ་ཕོག་བཅུག་ནི་མི་འོང་།','F000068.mp3','2022-05-18T17:51:15.872')
,(69,'ཕེབས་གྲུ།','བློན་པོ་ཕེབས་གྲུ་ནང་ལས་གདན་འདྲེན་ཞུ་དེས།','F000069.mp3','2022-05-18T17:51:15.872')
,(70,'བཙུན་ཆས།','བླམ་འདི་བཙུན་ཆས་བཞེས་ཏེ་བཞུགས་ནུག།',NULL,'2022-05-18T17:51:15.872')
,(71,'གླ་ཡོན།','གླ་ཡོན་ཚུ་མ་བཏུབ་བཏུབ་སྦེ་ཕུལ་དགོ།','F000071.mp3','2022-05-18T17:51:15.872')
,(72,'ལྗགས་གླིང་།','ལྗགས་གླིང་གི་སྒྲ་གནམ་མེད་ས་མེད་སྙན་ཏོང་ཏོ་འདུག།',NULL,'2022-05-18T17:51:15.872')
,(73,'མགྲིན་གླུ།','ཞབས་ཁྲ་འདི་དབྱངས་ཅན་ལྷ་མོའི་མགྲིན་གླུ་བཟུམ་སྦེ་འདུག།','F000073.mp3','2022-05-18T17:51:15.873')
,(74,'མགུལ་གླུ།','གཏེར་བདག་ཐུགས་དགྱེསཔ་ད་ མགུལ་གླུ་འཐེནམ་ཨིན་པས།','F000074.mp3','2022-05-18T17:51:15.873')
,(75,'སྐུ་གླུད།','བླ་མའི་སྐུ་གླུད་བཟོ་ནུག།','F000075.mp3','2022-05-18T17:51:15.873')
,(76,'མགུལ་གློ།','སློབ་དཔོན་གྱི་མགུལ་གློ་འདི་མེདཔ་ཐལ་ནུག།','F000076.mp3','2022-05-18T17:51:15.873')
,(77,'ལྗགས་གློ།','སྤྱི་ཏ་ལ་ནང་ལྗགས་གློ་ལྟེམ་ལྟེ་འདུག།',NULL,'2022-05-18T17:51:15.873')
,(78,'དགྱེས།','བློན་ཆེན་ཐུགས་དགྱེས་ནུག།',NULL,'2022-05-18T17:51:15.873')
,(79,'མཉེས།','སློབ་དབུ་འཛིན་ཐུགས་མཉེས་ནུག།',NULL,'2022-05-18T17:51:15.873')
,(80,'དགྱེས་སྐྱེམས།','ཨའི་གིས་སྐུ་མགྲོན་ཚུ་ལུ་དགྱེས་སྐྱེམས་དྲང་དེས།','F000080.mp3','2022-05-18T17:51:15.873')
,(81,'དགྱེས་སྟོན།','ནངས་པ་དགྱེས་སྟོན་ཅིག་བརྩི་སྲུང་ཞུ་ནི་ཨིན་མས།','F000081.mp3','2022-05-18T17:51:15.873')
,(82,'དབུ་རྒྱན།','སངས་རྒྱས་ཀྱི་སྐུ་འདྲ་འདི་ལུ་དངུལ་གྱི་དབུ་རྒྱན་ཅིག་ཕུལ་ཡི།','F000082.mp3','2022-05-18T17:51:15.873')
,(83,'དབུ་ཅན།',NULL,'F000083.mp3','2022-05-18T17:51:15.873')
,(84,'དབུ་ཡིག',NULL,'F000084.mp3','2022-05-18T17:51:15.873')
,(85,'དབུ་རས།','དབུ་རས་འདི་གོས་ཆེན་ཅིག་ཨིན་པས།','F000085.mp3','2022-05-18T17:51:15.873')
,(86,'སྐུ་མགྲོན།','དྲུང་ཆེན་མཆོག་ད་རིས་སྐུ་མགྲོན་སྦེ་བྱོན་གནང་ནུག།',NULL,'2022-05-18T17:51:15.873')
,(87,'སྐུ་མགྲོན་གཙོ་བོ།','ལས་རིམ་ནང་ལུ་སྐུ་མགྲོན་གཙོ་བོ་སྦེ་མགྲོན་བརྡ་ཕུལ་ནུག།',NULL,'2022-05-18T17:51:15.873')
,(88,'ཐུགས་འགན།','འདི་བླ་མའི་ཐུགས་འགན་ཨིན།','F000088.mp3','2022-05-18T17:51:15.873')
,(89,'དབུ་ཁྲིད་མཛད༌མི།','ཞལ་འཛོམས་ཀྱི་དབུ་ཁྲིད་མཛད་མི་འདི་ཁྲི་འཛིན་ཨིན་མས།',NULL,'2022-05-18T17:51:15.873')
,(90,'དབུ་ཁྲིད།','མི་དབང་མངའ་བདག་རིན་པོ་ཆེ་འདི་ཆོས་སྲིད་གཉིས་ཀྱི་དབུ་ཁྲིད་ཨིན།','F000090.mp3','2022-05-18T17:51:15.873')
,(91,'དབུ་ཁྲིད་ཞལ་འཛོམས།','དབུ་ཁྲིད་ཞལ་འཛོམས་འདི་ སྤྱི་ཟླ་ ༡༠ པའི་སྤྱི་ཚེས་ ༡༢ ལུ་འཚོག་ནི་ཨིན་མས།','F000091.mp3','2022-05-18T17:51:15.873')
,(92,'དབུ་འདྲེན།','རང་ལུགས་མདའ་རྩེད་འགྲན་བསྡུར་འདི་ རྫོང་བདག་གིས་དབུ་འདྲེན་མཛད་ནུག།','F000092.mp3','2022-05-18T17:51:15.873')
,(93,'དབུ་འཛུགས།','ལོ་བསྟར་སྨོན་ལམ་ཆེན་མོ་འདི་ཁ་ཙ་ལས་དབུ་འཛུགས་གནང་ནུག།','F000093.mp3','2022-05-18T17:51:15.873')
,(94,'དབུ་འཛིན།','དབུ་འཛིན་གྱི་ལེགས་དར་འདི་ནངས་པ་ཞུ་ནི་ཨིན་མས།','F000094.mp3','2022-05-18T17:51:15.873')
,(95,'འབྱོན།','འགོ་དཔོན་ཡིག་ཚང་ནང་འབྱོན་དེས།','F000095.mp3','2022-05-18T17:51:15.873')
,(96,'ཐུགས་འགྱོད།','ཧེ་མ་ཐལ་ཚར་བའི་ལཱ་ལུ་ཐུགས་འགྱོད་བསྐྱེད་དགོཔ་མེད།',NULL,'2022-05-18T17:51:15.873')
,(97,'ཞལ་འགྲམ།','སློབ་དཔོན་གྱི་ཞལ་འགྲམ་འདི་ག་ཅི་འབད་ཡི?',NULL,'2022-05-18T17:51:15.873')
,(98,'སྐུ་ངལ།','བློན་པོ་འདི་སྐུ་ངལ་གནང་དེས།',NULL,'2022-05-18T17:51:15.873')
,(99,'སྐུ་ཐོག།','བླ་མའི་སྐུ་ཐོག་འདི་ལུ་ཕྲིན་ལས་དར་ཞིང་རྒྱས་པའི་སྨོན་ལམ་ཡོད།','F000099.mp3','2022-05-18T17:51:15.873')
,(100,'སྐུ་པར།','འདི་སངས་རྒྱས་ཀྱི་སྐུ་པར་ཨིན་མས།','F000100.mp3','2022-05-18T17:51:15.873')
,(101,'སྐུ་ངོ།','སྐུ་ངོ་ཁ་ཐུག་ལས་མ་བཏུབ་མེདཔ་སྦེ་གསུངས་ཡི།','F000101.mp3','2022-05-18T17:51:15.873')
,(102,'ཞལ་སྐྱེངས།','མཁས་པ་ལ་ལུ་ཅིག་སྐྱོན་བརྗོད་འབད་ནི་འདི་གིས་ཞལ་སྐྱེངས་ནུག།','F000102.mp3','2022-05-18T17:51:15.873')
,(103,'སྐུ་ཚབ།','ཕྱིའི་རྒྱལ་ཁབ་ཀྱི་སྐུ་ཚབ་ཚུ་བཞུགས་ཏེ་འདུག།','F000103.mp3','2022-05-18T17:51:15.873')
,(104,'ཞལ་འཛུམ།','ཞལ་འཛུམ་འདི་ག་ནི་བ་མཚར་བས།',NULL,'2022-05-18T17:51:15.873')
,(105,'ཞལ་འདྲིས།','ངེ་གི་འགོ་དཔོན་དང་དྲག་ཤོས་འདི་ཧེ་མ་ལས་ར་ཞལ་འདྲིས་སྡོད་ནུག།',NULL,'2022-05-18T17:51:15.873')
,(106,'ཕྱག་དངུལ།','དེ་ཚུ་དཔོན་གྱི་ཕྱག་དངུལ་ཨིན།',NULL,'2022-05-18T17:51:15.873')
,(107,'སྐུ་དངོས།','དྲག་ཤོས་ནཱ་ལུ་སྐུ་དངོས་སྦེ་བྱོན་མི་ལུ་དགའ་ཚོར་ཡོད།','F000107.mp3','2022-05-18T17:51:15.873')
,(108,'ལྷུམས།','ས་ག་ཟླ་བའི་ཚེས་ ༡༥ འདི་སངས་རྒྱས་ལྷུམས་སུ་ཞུགས་པའི་དུས་ཆེན་ཡང་ཨིན།','F000108.mp3','2022-05-18T17:51:15.873')
,(109,'ཞལ་སྔགས།','སྔགས་མར་འདི་བླམ་ལས་ཞལ་སྔགས་ཞུ་ཡི།',NULL,'2022-05-18T17:51:15.873')
,(110,'བཤུམ།','དྲག་ཤོས་ཐུགས་ཀྱིས་བཟོད་མ་ཚུགས་པར་བཤུམ་དེས།','F000110.mp3','2022-05-18T17:51:15.873')
,(111,'སྐུ་ཆས།','བླ་མའི་སྐུ་ཆས་ཚུ་ལེགས་ཤོམ་སྦེ་བདག་འཛིན་འབད་དགོ།',NULL,'2022-05-18T17:51:15.873')
,(112,'གསོལ་ཅོག','ཕྱག་དཔེ་འདི་བླ་མའི་གསོལ་ཅོག་གུར་འདུག།',NULL,'2022-05-18T17:51:15.873')
,(113,'བསྙེལ།','གནད་དོན་འདི་གི་སྐོར་ལས་དྲག་ཤོས་ཀྱིས་ཐུགས་ལས་བསྙེལ་མ་གནང་།',NULL,'2022-05-18T17:51:15.874')
,(114,'ཐུགས་བསྙེལ།','རིན་པོ་ཆེ་ཚུ་གིས་སེམས་ཅན་ལུ་འགྲོ་དོན་མཛན་ནི་འདི་ནམ་ཡང་ཐུགས་བསྙེལ་ནི་མེད།',NULL,'2022-05-18T17:51:15.874')
,(115,'བསྙེལ་ཐོ།','འ་ནཱི་འདི་སློབ་དཔོན་གྱི་བསྙེལ་ཐོ་ཨིན་མས།','F000115.mp3','2022-05-18T17:51:15.874')
,(116,'སྐུ་ཉམས།','སློབ་དཔོན་འདི་སྐུ་ཉམས་ཤོར་ནུག།',NULL,'2022-05-18T17:51:15.874')
,(117,'གཟིམ།','གཙོ་འཛིན་ད་ཅི་ལས་གཟིམ་ད་ཡི།','F000117.mp3','2022-05-18T17:51:15.874')
,(118,'གཟིམ་ཁང་།','བླ་མ་གི་གཟིམ་ཁང་ནཱ་ཨིན་ན་ལགས?','F000118.mp3','2022-05-18T17:51:15.874')
,(119,'གཟིམ་ཁྲི།','རིན་པོ་ཆེ་གི་གཟིམ་ཁྲི་རྒྱུ་ག་ཅི་གིས་བཟོ་བཟོཝ་སྨོ?','F000119.mp3','2022-05-18T17:51:15.874')
,(120,'གཟིམ་ཆས།','མགྱོནམོ་གི་གཟིམ་ཆས་གྲ་སྒྲིག་འབད་ཡི་ག?','F000120.mp3','2022-05-18T17:51:15.874')
,(121,'གཟིམ་གདན།','སློབ་དཔོན་གྱིས་གཟིམ་གདན་ག་ཏེ་ལས་ཉོ་ཡི?','F000121.mp3','2022-05-18T17:51:15.874')
,(122,'གཟིམ་ཤག།','མཁན་ཆེན་གྱི་དོན་ལུ་གཟིམ་ཤག་ལེགས་ཤོམ་སྦེ་བཅའ་སྒྲིག་རྐྱབ་དེས།','F000122.mp3','2022-05-18T17:51:15.874')
,(123,'གཟིམ་ས།','དགེ་བཤེས་གཟིམ་ས་ཧེ་མ་ལས་གྲ་སྒྲིག་འབད་ནུག།','F000123.mp3','2022-05-18T17:51:15.874')
,(124,'གསོལཝ།','དྲག་ཤོས་ གསོལཝ་བཞེས་པར་ག་ཏེ་བྱོན་ནི་སྨོ་ལགས?','F000124.mp3','2022-05-18T17:51:15.874')
,(125,'སྐུ༌ཉིད།','ཕྱག་ལཱ་འདི་སྐུ་ཉིད་ཀྱིས་ར་མཛད་གནང་དགོ་ལགས།',NULL,'2022-05-18T17:51:15.874')
,(126,'དབུ་གདུགས།','མཁན་པོ་གི་དོན་ལུ་དབུ་གདུགས་སྦོམ་ཅིག་ཉོ་དགོ་པས།','F000126.mp3','2022-05-18T17:51:15.874')
,(127,'དགུང་ཞག།','སློབ་དཔོན་ཁ་ཙ་དགུང་ཞག་ག་ཏེ་བཞུགས་ཅི་ལགས?','F000127.mp3','2022-05-18T17:51:15.874')
,(128,'སྐུ་ཉེ།','སློབ་དཔོན་པདྨ་ལུ་སྐུ་ཉེ་ལེ་ཤ་འདུག།',NULL,'2022-05-18T17:51:15.874')
,(129,'སྐུ་འཁོར།','བློན་པོ་གི་སྐུ་འཁོར་ཚུ་ག་ཏེ་བཞུགས་ཏེ་ཡོད་གོ་ལགས།','F000129.mp3','2022-05-18T17:51:15.874')
,(130,'ཆིབས་ར།','རྫོང་བདག་གི་ཆིབས་རྟ་ཆིབས་ར་ནང་བཏགས་བཞག་ནུག།','F000130.mp3','2022-05-18T17:51:15.874')
,(131,'ཕྱག་བྱིག','ཁ་ཙ་སྐུ་དྲུང་གིས་དགེ་སློང་དག་པ་ཅིག་ལུ་ཕྱག་བྱིག་གནང་ནུག།',NULL,'2022-05-18T17:51:15.874')
,(132,'གཟིགས།','ནཱ་ལུ་ལེགས་ཤོམ་སྦེ་གཟིགས་ཤིག་ལགས།','F000132.mp3','2022-05-18T17:51:15.874')
,(133,'གཟིགས་སྐོར།','དྲག་ཤོས་གཟིགས་སྐོར་ལུ་བྱོན་ནུག།','F000133.mp3','2022-05-18T17:51:15.874')
,(134,'གཟིགས་རྟོག','ངན་ལྷད་བཀག་སྡོམ་ལྷན་ཚོགས་ཀྱིས་གཟིགས་རྟོག་ཞིབ་ཞིབ་སྦེ་གནང་བའི་བསྒང་འདུག།','F000134.mp3','2022-05-18T17:51:15.874')
,(135,'གཟིགས་ཞིབ།','དྲག་ཤོས་ཀྱིས་གཟིགས་ཞིབ་ལེགས་ཤོམ་སྦེ་གནང་དོ།','F000135.mp3','2022-05-18T17:51:15.874')
,(136,'གསོལ་ཚོགས།','སྤྲུལ་སྐུ་ལུ་གསོལ་ཚོགས་ག་ཅི་དྲངམ་སྨོ?','F000136.mp3','2022-05-18T17:51:15.874')
,(137,'གསོལཝ་གྲོལ།','བླམ་ད་ཅི་ལས་གསོལཝ་གྲོལ་ནུག།',NULL,'2022-05-18T17:51:15.874')
,(138,'གསོལ་རྒྱགས།','དགེ་བཤེས་གྱི་གསོལ་རྒྱགས་གྲ་སྒྲིག་འབད་ཡི་ག?','F000138.mp3','2022-05-18T17:51:15.874')
,(139,'གསོལཝ་དྲང།','མཁན་ཆེན་ལུ་གསོལཝ་ཞིམ་ཏོང་ཏོ་དྲངས་ཤིག།','F000139.mp3','2022-05-18T17:51:15.874')
,(140,'བཞེས་རས།','སློབ་དཔོན་གྱིས་བཞེས་རས་བསྣམས་བྱོན་ཡི་ག་ལགས?','F000140.mp3','2022-05-18T17:51:15.874')
,(141,'བཞེས་ལྷག།','བླ་མའི་བཞེས་ལྷག་ཞུ་འབག་འོངས་ཡི།','F000141.mp3','2022-05-18T17:51:15.875')
,(142,'གསོལ་ལྷག།','འདི་དྲག་ཤོས་ཀྱི་གསོལ་ལྷག་ཨིན་མས།','F000142.mp3','2022-05-18T17:51:15.875')
,(143,'གསོལཝ་བསྙུངས།','ལམ་ཐག་རིང་ས་ལས་བྱོན་ནི་འདི་གིས་མགྱོནམོ་ཚུ་གསོལཝ་བསྙུངས་ནུག།',NULL,'2022-05-18T17:51:15.875')
,(147,'མཆོད་ཆང་།','འགོ་དཔོན་ཚུ་མཆོད་ཆང་བཞེས་པར་འབྱོན་ནི་མས།','F000147.mp3','2022-05-18T17:51:15.875')
,(148,'གསོལ་ཆུ།','སྐུ་མགྲོན་ལུ་གསོལ་ཆུ་བསིལ་ཏོང་ཏོ་ཅིག་དྲངས་ཤིག།','F000148.mp3','2022-05-18T17:51:15.875')
,(149,'བཞེས་དར།','ཚོགས་དང་གཅིག་ཁར་བཞེས་དར་ཡང་འདུག།','F000149.mp3','2022-05-18T17:51:15.875')
,(150,'གསོལ་དུག།','ཁོང་ག་ར་གསོལ་དུག་དྲངས་ཏེ་བཀྲོངས་ནུག།','F000150.mp3','2022-05-18T17:51:15.875')
,(151,'སྐུ་མཆོད།','ཞབས་དྲུང་རིན་པོ་ཆེ་གི་སྐུ་མཆོད་འདི་ནངས་པ་ཕོགཔ་ཨིན།','F000151.mp3','2022-05-18T17:51:15.875')
,(152,'ཐུགས་དོགས།','འགོ་དཔོན་ཚུ་ཐུགས་དོགས་ཏེ་བཞུགས་ནུག།','F000152.mp3','2022-05-18T17:51:15.875')
,(153,'ཐུགས།','བླ་མའི་ཐུགས་འདི་ག་ནི་བ་འཇམ་པས།','F000153.mp3','2022-05-18T17:51:15.875')
,(154,'སྐུ་དོརམ།','སློབ་དཔོན་གྱི་སྐུ་དོརམ་ཚོས་གཞི་དམརཔོ་ཨིན་མས།','F000154.mp3','2022-05-18T17:51:15.875')
,(155,'སྐུ་དྲག།','སྐུ་དྲག་མང་ཤོས་ཅིག་ཐུགས་རིག་བཟང་མས།','F000155.mp3','2022-05-18T17:51:15.875')
,(156,'སྐུ་དྲིན།','ང་ལེགས་ཤོམ་འགྱོ་མི་འདི་སློབ་དཔོན་གྱི་སྐུ་དྲིན་ཨིན།','F000156.mp3','2022-05-18T17:51:15.875')
,(157,'བཀའ་དྲིན།','ལམ་འགྲོ་ལེགས་ཤོམ་འགྱོ་མི་འདི་བླ་མའི་བཀའ་དྲིན་ཨིན།','F000157.mp3','2022-05-18T17:51:15.875')
,(158,'ཞལ།','བླ་མའིི་ཞལ་ལས་གདམས་ངག་ཟབ་མོ་ཅིག་གནང་ཡི།',NULL,'2022-05-18T17:51:15.875')
,(160,'སྐུ་མདུན།','ཚོགས་དམངས་ཀྱི་སྐུ་མདུན་ལུ་གཟབ་གཟབ་འབད་དགོ།',NULL,'2022-05-18T17:51:15.875')
,(161,'བསྙུང་།','བླམ་སྐུ་བསྙུང་ནི་བཟུམ་ཅིག་འདུག་ཟེར་སླབ་དེས།',NULL,'2022-05-18T17:51:15.875')
,(162,'ཐུགས་དོག།','སློབ་དཔོན་གྱིས་ཐུགས་དོག་སྟེ་བཞུགས་མ་གནང།',NULL,'2022-05-18T17:51:15.875')
,(164,'སྐུ་ནད།','སློབ་དཔོན་འདི་སྐུ་ནད་ཅིག་གིས་བསྙུངས་ཏེ་བཞུགས་ནུག།',NULL,'2022-05-18T17:51:15.875')
,(165,'སྙུང་གཞི་དྭངས།','ཨ་ཞང་འདི་སྙུང་གཞི་དྭངས་ནུག།',NULL,'2022-05-18T17:51:15.875')
,(166,'སྙུན་མེད།','ད་རེས་ནངས་པ་ ཁོང་ག་ར་སྙུན་མེད་སྦེ་བཞུགས་ནུག།',NULL,'2022-05-18T17:51:15.875')
,(167,'སྙུང་གཞི།','དྲག་ཤོས་ལུ་སྙུང་གཞི་ག་ཅི་ཡང་མིན་འདུག།',NULL,'2022-05-18T17:51:15.875')
,(168,'ལྕམ་སྲིང་།','ཨ་ཞང་ལུ་ལྕམ་སྲིང་ག་དེམ་ཅིག་ཡོད?','F000168.mp3','2022-05-18T17:51:15.875')
,(169,'བཀའ་གྲོལ།','ལཱ་འགོ་བཙུགས་ཆོག་པའི་བཀའ་གྲོལ་ཅིག་གནང་ཡི།','F000169.mp3','2022-05-18T17:51:15.875')
,(170,'དབུ་མནའ།','སློབ་དཔོན་གྱིས་དཔེ་ཆ་ལེགས་ཤོམ་སྟོན་འོང་ཟེར་དབུ་མནའ་བཞེས་ཡི།','F000170.mp3','2022-05-18T17:51:15.875')
,(171,'ཐུགས་དོན།','དྲག་ཤོས་ཀྱི་ཐུགས་དོན་འགྲུབ་བཅུག་ཅིག་ཟེར་བའི་སྨོན་ལམ་ཡོད།','F000171.mp3','2022-05-18T17:51:15.875')
,(172,'ཐུགས་བསམ།','ཕྱག་ལཱ་མ་མཛད་པའི་ཧེ་མ་ཐུགས་བསམ་ལེགས་ཤོམ་སྦེ་གནང་དགོ།','F000172.mp3','2022-05-18T17:51:15.875')
,(173,'དགོངས་བཞེད།','སློབ་དཔོན་གྱི་དགོངས་བཞེད་ལེགས་ཤོམ་འདུག།','F000173.mp3','2022-05-18T17:51:15.875')
,(174,'ཐུགས་དགོངས།','གོངམ་གི་ཐུགས་དགོངས་འགྲུབ་ནིའི་དོན་ལུ་བརྩོན་ཤུགས་བསྐྱེད་དགོ།','F000174.mp3','2022-05-18T17:51:15.875')
,(175,'ཐུགས་བཞེད།','ཕྱག་ལཱ་འགོ་མ་བཙུགས་པའི་ཧེ་མ་ཐུགས་བཞེད་ལེགས་ཤོམ་སྦེ་གནང་དགོ།','F000175.mp3','2022-05-18T17:51:15.875')
,(176,'སྙན་རྒྱན།','སྲསམོ་གིས་གསེར་གྱི་སྙན་རྒྱན་ཅིག་བཞེས་ནུག།',NULL,'2022-05-18T17:51:15.875')
,(177,'སྙན་རྒྱུན།','སྐུ་གོངམ་གི་སྙན་རྒྱུན་ཚུ་ཧ་ལས་སི་སི་འདུག།',NULL,'2022-05-18T17:51:15.875')
,(178,'ཡབ་སྲས།','ཁོང་ཡབ་སྲས་གཉིས་མཇལ་འཕྲད་གནང་ཡི།','F000178.mp3','2022-05-18T17:51:15.875')
,(179,'ཡབ་ཡུམ།','ཡབ་ཡུམ་གཉིས་གཟིམ་ཅུང་ནང་བཞུགས་ནུག།','F000179.mp3','2022-05-18T17:51:15.875')
,(180,'འཁྲུངས་ཡུལ།','ཁོ་གི་འཁྲུངས་ཡུལ་སྤ་རོ་ཨིན།','F000180.mp3','2022-05-18T17:51:15.875')
,(181,'སྐུ་ཕུང༌།','བླ་མའི་སྐུ་ཕུང་གདན་འདྲེན་ཞུ་དེས།','F000181.mp3','2022-05-18T17:51:15.875')
,(182,'སྐུ༌གདུང་།','ནངས་པ་སྐུ་གདུང་མཆོད་རྟེན་མཇལ་བར་འགྱོ་ནི་ཨིན།','F000182.mp3','2022-05-18T17:51:15.875')
,(183,'སྐུ་པུར།','ད་རིས་བླམ་གི་སྐུ་པུར་མཇལ་ཁ་གནང་དེས།','F000183.mp3','2022-05-18T17:51:15.875')
,(184,'གསོལ་ཕོགས།','དྲག་ཤོས་ཀྱི་གསོལ་ཕོགས་ག་དེམ་ཅིག་ཡོད།',NULL,'2022-05-18T17:51:15.875')
,(185,'སྐུ་ཕོ།','འགོ་དཔོན་གྱི་སྐུ་ཕོ་གུར་རྨ་ཅིག་ཐོན་ནུག།','F000185.mp3','2022-05-18T17:51:15.875')
,(186,'བཞེས་ཆ།','སློབ་དཔོན་ཚུ་གིས་བཞེས་ཆ་བསྣམས་མ་བྱོན་པས།','F000186.mp3','2022-05-18T17:51:15.876')
,(187,'བཞེས་ཕོར།','བླམ་ལུ་བཞེས་ཕོར་སོ་སོ་ཅིག་ནང་བླུགས་དྲང་དགོ་པས།','F000187.mp3','2022-05-18T17:51:15.876')
,(188,'ཞལ་ཕོར།','དྲག་ཤོས་ལུ་གསོལ་ཇ་ཞལ་ཕོར་ནང་བླུགས་ཏེ་དྲང་།',NULL,'2022-05-18T17:51:15.876')
,(189,'ཚོགས།','ང་གིས་དགེ་འདུན་པ་ཡོངས་ལུ་ཚོགས་ཅིག་དྲང་གེ།','F000189.mp3','2022-05-18T17:51:15.876')
,(190,'གསོལ་ཕྱེ།','གྲུབ་ཐོབ་མང་ཤོས་ར་འཚོ་བ་གསོལ་ཕྱེ་ལུ་བསྟེན་ཏེ་བཞུགས་ནུག།','F000190.mp3','2022-05-18T17:51:15.876')
,(191,'ཕྱག་ཕྲེང་།','བླ་མའི་ཕྱག་ཕྲེང་འདི་ནཱ་ལུས་སོ་ནུག།','F000191.mp3','2022-05-18T17:51:15.876')
,(192,'མཇལ།','མོ་གིས་རང་བྱུང་ཁར་ས་པ་ཎི་གི་རྟེན་མཇལ་ནུག།',NULL,'2022-05-18T17:51:15.876')
,(193,'ཞལ་འབག།','གུ་རུའི་ཞལ་འབགཔ་འདི་བླམ་གནས་རྟེན་གྱིས་བཞེས་ནུག།',NULL,'2022-05-18T17:51:15.876')
,(194,'མངའ་འབངས།','དཔོན་གྱིས་མངའ་འབངས་ཡོངས་ལུ་གསུང་བཤད་ཅིག་གནང་ནུག།','F000194.mp3','2022-05-18T17:51:15.876')
,(195,'བཀའ་འབངས།','བཀའ་འབངས་ཡོངས་ཀྱིས་ཕྱག་ལེགས་ཤོམ་ཞུ་དེས།','F000195.mp3','2022-05-18T17:51:15.876')
,(196,'མཛད་ཐངས།','རྒྱལ་སྲས་ཀྱི་མཛད་ཐངས་ཚུ་ཡ་མཚན་ཆེ་བས།',NULL,'2022-05-18T17:51:15.876')
,(197,'མཛད་འཕྲོ།','དྲག་ཤོས་ཀྱི་མཛད་འཕྲོ་ཚུ་ ང་གིས་འཕྲོ་མཐུད་དེ་འབདཝ་ཨིན།',NULL,'2022-05-18T17:51:15.876')
,(198,'མཛད་མི།','འ་ནཱི་རྣམ་ཐར་མཛད་མི་མཁན་པོ་ཅིག་ཨིན།',NULL,'2022-05-18T17:51:15.876')
,(199,'མཛད་བྱ།','གོངམ་གི་མཛད་བྱ་ཚུ་སེམས་ཁར་དྲན་དགོ།',NULL,'2022-05-18T17:51:15.876')
,(200,'མཛད་ཤུལ།','སློབ་དཔོན་གྱི་མཛད་ཤུལ་ཚུ་ཧ་ལས་སི་སི་འདུག།',NULL,'2022-05-18T17:51:15.876');
''');

    await db.rawInsert(
        '''INSERT INTO DzongkhaZhebsa(DzongkhadId,ZhebsazId,updateTime) VALUES
 (1,1,'2022-05-18T17:44:56.581')
,(2,2,'2022-05-18T17:44:56.581')
,(3,3,'2022-05-18T17:44:56.581')
,(4,4,'2022-05-18T17:44:56.581')
,(5,5,'2022-05-18T17:44:56.581')
,(5,6,'2022-05-18T17:44:56.581')
,(6,7,'2022-05-18T17:44:56.581')
,(7,8,'2022-05-18T17:44:56.581')
,(8,8,'2022-05-18T17:44:56.581')
,(9,9,'2022-05-18T17:44:56.581')
,(10,10,'2022-05-18T17:44:56.581')
,(11,11,'2022-05-18T17:44:56.581')
,(12,12,'2022-05-18T17:44:56.581')
,(13,13,'2022-05-18T17:44:56.581')
,(14,14,'2022-05-18T17:44:56.581')
,(15,15,'2022-05-18T17:44:56.581')
,(16,16,'2022-05-18T17:44:56.581')
,(17,17,'2022-05-18T17:44:56.581')
,(18,18,'2022-05-18T17:44:56.581')
,(19,19,'2022-05-18T17:44:56.581')
,(20,20,'2022-05-18T17:44:56.581')
,(21,21,'2022-05-18T17:44:56.581')
,(22,22,'2022-05-18T17:44:56.581')
,(23,23,'2022-05-18T17:44:56.581')
,(24,24,'2022-05-18T17:44:56.581')
,(25,25,'2022-05-18T17:44:56.581')
,(26,26,'2022-05-18T17:44:56.581')
,(27,27,'2022-05-18T17:44:56.581')
,(28,27,'2022-05-18T17:44:56.581')
,(29,28,'2022-05-18T17:44:56.581')
,(29,29,'2022-05-18T17:44:56.581')
,(30,30,'2022-05-18T17:44:56.581')
,(31,31,'2022-05-18T17:44:56.581')
,(32,32,'2022-05-18T17:44:56.581')
,(33,33,'2022-05-18T17:44:56.581')
,(34,34,'2022-05-18T17:44:56.581')
,(35,35,'2022-05-18T17:44:56.581')
,(36,36,'2022-05-18T17:44:56.581')
,(37,37,'2022-05-18T17:44:56.581')
,(38,38,'2022-05-18T17:44:56.581')
,(39,39,'2022-05-18T17:44:56.581')
,(40,40,'2022-05-18T17:44:56.581')
,(41,41,'2022-05-18T17:44:56.581')
,(42,42,'2022-05-18T17:44:56.581')
,(43,43,'2022-05-18T17:44:56.581')
,(44,44,'2022-05-18T17:44:56.581')
,(45,45,'2022-05-18T17:44:56.581')
,(46,46,'2022-05-18T17:44:56.581')
,(47,47,'2022-05-18T17:44:56.581')
,(48,48,'2022-05-18T17:44:56.581')
,(49,49,'2022-05-18T17:44:56.581')
,(50,50,'2022-05-18T17:44:56.582')
,(51,51,'2022-05-18T17:44:56.582')
,(52,52,'2022-05-18T17:44:56.582')
,(53,53,'2022-05-18T17:44:56.582')
,(54,54,'2022-05-18T17:44:56.582')
,(55,55,'2022-05-18T17:44:56.582')
,(56,56,'2022-05-18T17:44:56.582')
,(57,57,'2022-05-18T17:44:56.582')
,(58,58,'2022-05-18T17:44:56.582')
,(59,59,'2022-05-18T17:44:56.582')
,(60,60,'2022-05-18T17:44:56.582')
,(61,61,'2022-05-18T17:44:56.582')
,(62,62,'2022-05-18T17:44:56.582')
,(63,63,'2022-05-18T17:44:56.582')
,(63,64,'2022-05-18T17:44:56.582')
,(64,65,'2022-05-18T17:44:56.582')
,(65,66,'2022-05-18T17:44:56.582')
,(66,67,'2022-05-18T17:44:56.582')
,(67,68,'2022-05-18T17:44:56.582')
,(68,69,'2022-05-18T17:44:56.582')
,(69,70,'2022-05-18T17:44:56.582')
,(70,71,'2022-05-18T17:44:56.582')
,(71,72,'2022-05-18T17:44:56.582')
,(72,73,'2022-05-18T17:44:56.582')
,(72,74,'2022-05-18T17:44:56.582')
,(73,73,'2022-05-18T17:44:56.582')
,(73,74,'2022-05-18T17:44:56.582')
,(74,75,'2022-05-18T17:44:56.582')
,(75,76,'2022-05-18T17:44:56.582')
,(76,77,'2022-05-18T17:44:56.582')
,(77,78,'2022-05-18T17:44:56.582')
,(77,79,'2022-05-18T17:44:56.582')
,(78,80,'2022-05-18T17:44:56.582')
,(79,81,'2022-05-18T17:44:56.582')
,(80,82,'2022-05-18T17:44:56.582')
,(81,83,'2022-05-18T17:44:56.582')
,(82,84,'2022-05-18T17:44:56.582')
,(83,85,'2022-05-18T17:44:56.582')
,(84,86,'2022-05-18T17:44:56.582')
,(85,87,'2022-05-18T17:44:56.582')
,(86,88,'2022-05-18T17:44:56.582')
,(87,88,'2022-05-18T17:44:56.582')
,(88,89,'2022-05-18T17:44:56.582')
,(89,90,'2022-05-18T17:44:56.582')
,(90,91,'2022-05-18T17:44:56.582')
,(91,92,'2022-05-18T17:44:56.582')
,(92,93,'2022-05-18T17:44:56.582')
,(93,94,'2022-05-18T17:44:56.582')
,(94,95,'2022-05-18T17:44:56.582')
,(95,96,'2022-05-18T17:44:56.582')
,(96,97,'2022-05-18T17:44:56.582')
,(97,98,'2022-05-18T17:44:56.582')
,(98,99,'2022-05-18T17:44:56.582')
,(99,100,'2022-05-18T17:44:56.582')
,(100,101,'2022-05-18T17:44:56.582')
,(101,102,'2022-05-18T17:44:56.582')
,(102,103,'2022-05-18T17:44:56.582')
,(103,104,'2022-05-18T17:44:56.582')
,(104,105,'2022-05-18T17:44:56.582')
,(105,106,'2022-05-18T17:44:56.582')
,(106,107,'2022-05-18T17:44:56.582')
,(107,108,'2022-05-18T17:44:56.582')
,(108,109,'2022-05-18T17:44:56.582')
,(109,110,'2022-05-18T17:44:56.582')
,(110,111,'2022-05-18T17:44:56.582')
,(111,112,'2022-05-18T17:44:56.582')
,(112,113,'2022-05-18T17:44:56.582')
,(112,114,'2022-05-18T17:44:56.582')
,(113,115,'2022-05-18T17:44:56.582')
,(114,116,'2022-05-18T17:44:56.582')
,(115,117,'2022-05-18T17:44:56.582')
,(116,118,'2022-05-18T17:44:56.582')
,(117,119,'2022-05-18T17:44:56.582')
,(118,120,'2022-05-18T17:44:56.582')
,(119,121,'2022-05-18T17:44:56.582')
,(120,122,'2022-05-18T17:44:56.582')
,(121,123,'2022-05-18T17:44:56.582')
,(122,124,'2022-05-18T17:44:56.582')
,(123,125,'2022-05-18T17:44:56.582')
,(124,126,'2022-05-18T17:44:56.582')
,(125,127,'2022-05-18T17:44:56.582')
,(126,128,'2022-05-18T17:44:56.582')
,(126,129,'2022-05-18T17:44:56.582')
,(127,128,'2022-05-18T17:44:56.582')
,(127,129,'2022-05-18T17:44:56.582')
,(128,130,'2022-05-18T17:44:56.582')
,(129,131,'2022-05-18T17:44:56.582')
,(130,132,'2022-05-18T17:44:56.582')
,(131,133,'2022-05-18T17:44:56.582')
,(132,134,'2022-05-18T17:44:56.582')
,(133,135,'2022-05-18T17:44:56.582')
,(134,136,'2022-05-18T17:44:56.582')
,(135,137,'2022-05-18T17:44:56.582')
,(136,138,'2022-05-18T17:44:56.582')
,(137,139,'2022-05-18T17:44:56.582')
,(138,140,'2022-05-18T17:44:56.582')
,(139,141,'2022-05-18T17:44:56.582')
,(139,142,'2022-05-18T17:44:56.582')
,(140,143,'2022-05-18T17:44:56.582')
,(144,147,'2022-05-18T17:44:56.582')
,(145,148,'2022-05-18T17:44:56.582')
,(146,149,'2022-05-18T17:44:56.582')
,(147,150,'2022-05-18T17:44:56.582')
,(148,151,'2022-05-18T17:44:56.582')
,(149,152,'2022-05-18T17:44:56.582')
,(150,153,'2022-05-18T17:44:56.582')
,(151,154,'2022-05-18T17:44:56.582')
,(152,155,'2022-05-18T17:44:56.582')
,(153,156,'2022-05-18T17:44:56.582')
,(153,157,'2022-05-18T17:44:56.582')
,(154,158,'2022-05-18T17:44:56.582')
,(155,160,'2022-05-18T17:44:56.582')
,(156,161,'2022-05-18T17:44:56.582')
,(157,162,'2022-05-18T17:44:56.583')
,(159,164,'2022-05-18T17:44:56.583')
,(160,165,'2022-05-18T17:44:56.583')
,(161,166,'2022-05-18T17:44:56.583')
,(162,167,'2022-05-18T17:44:56.583')
,(163,168,'2022-05-18T17:44:56.583')
,(164,169,'2022-05-18T17:44:56.583')
,(165,170,'2022-05-18T17:44:56.583')
,(166,171,'2022-05-18T17:44:56.583')
,(167,172,'2022-05-18T17:44:56.583')
,(167,173,'2022-05-18T17:44:56.583')
,(167,174,'2022-05-18T17:44:56.583')
,(167,175,'2022-05-18T17:44:56.583')
,(168,176,'2022-05-18T17:44:56.583')
,(169,177,'2022-05-18T17:44:56.583')
,(170,178,'2022-05-18T17:44:56.583')
,(171,179,'2022-05-18T17:44:56.583')
,(172,180,'2022-05-18T17:44:56.583')
,(173,181,'2022-05-18T17:44:56.583')
,(173,182,'2022-05-18T17:44:56.583')
,(173,183,'2022-05-18T17:44:56.583')
,(174,184,'2022-05-18T17:44:56.583')
,(175,185,'2022-05-18T17:44:56.583')
,(176,186,'2022-05-18T17:44:56.583')
,(176,187,'2022-05-18T17:44:56.583')
,(176,188,'2022-05-18T17:44:56.583')
,(177,189,'2022-05-18T17:44:56.583')
,(178,190,'2022-05-18T17:44:56.583')
,(179,191,'2022-05-18T17:44:56.583')
,(180,192,'2022-05-18T17:44:56.583')
,(181,193,'2022-05-18T17:44:56.583')
,(182,194,'2022-05-18T17:44:56.583')
,(182,195,'2022-05-18T17:44:56.583')
,(183,196,'2022-05-18T17:44:56.583')
,(184,197,'2022-05-18T17:44:56.583')
,(185,198,'2022-05-18T17:44:56.583')
,(186,199,'2022-05-18T17:44:56.583')
,(187,200,'2022-05-18T17:44:56.583');
''');
  }

  Future<List> populateSearch() async {
    final db = await _databaseService.database;
    return await db.rawQuery(
        'SELECT dWord AS sWord FROM Dzongkha UNION SELECT zWord FROM Zhebsa');
  }

  Future<List> populateHistory() async {
    final db = await _databaseService.database;
    return await db.rawQuery(
        'SELECT * FROM (SELECT dWord AS hWord, dHistory as hHistory FROM Dzongkha WHERE dHistory !="" UNION SELECT zWord, zHistory FROM Zhebsa WHERE zHistory !="") ORDER BY 2 DESC LIMIT 10');
  }

  Future<List> searchDzongkha(String word) async {
    final db = await _databaseService.database;
    return await db.query('Dzongkha', where: 'dWord = ?', whereArgs: [word]);
  }

  Future<List> searchZhesaWord(String word) async {
    final db = await _databaseService.database;
    return await db.query('Zhebsa', where: 'zWord = ?', whereArgs: [word]);
  }

  Future<List> getZhebsaSearchId(int did) async {
    final db = await _databaseService.database;
    final List zhesaIdList = []; //DzongkhadId, ZhebsazId, updateTime
    var data = await db.query('DzongkhaZhebsa',
        columns: ['ZhebsazId'],
        where: 'DzongkhadId = ?',
        whereArgs: [did]); //columns: ['ZhebsazId']

    for (int i = 0; i < data.length; i++) {
      zhesaIdList.add(data[i]['ZhebsazId']);
    }
    return zhesaIdList;
  }

  Future<List> getDzongkhaSearchId(int zid) async {
    final db = await _databaseService.database;
    final List dzongkhaIdList = []; //DzongkhadId, ZhebsazId, updateTime
    var data = await db.query('DzongkhaZhebsa',
        columns: ['DzongkhadId'],
        where: 'ZhebsazId = ?',
        whereArgs: [zid]); //columns: ['ZhebsazId']

    for (int i = 0; i < data.length; i++) {
      dzongkhaIdList.add(data[i]['DzongkhadId']);
    }
    return dzongkhaIdList;
  }

  Future<List> getZhebsaSearch(List zhesaID) async {
    final db = await _databaseService.database;
    return await db.query('Zhebsa',
        where: 'zId IN (${('?' * (zhesaID.length)).split('').join(', ')})',
        whereArgs: zhesaID);
  }

  Future<List> getDzongkhaSearch(List dzongkhaID) async {
    final db = await _databaseService.database;
    return await db.query('Dzongkha',
        where: 'dId IN (${('?' * (dzongkhaID.length)).split('').join(', ')})',
        whereArgs: dzongkhaID);
  }

  Future<void> updateFavourite(
      int id, String favourite, String tableName) async {
    final db = await _databaseService.database;
    if (tableName == 'Zhebsa') {
      await db.rawUpdate(
          'UPDATE Zhebsa SET zFavourite = ? WHERE zId = ?', [favourite, id]);
    } else if (tableName == 'Dzongkha') {
      await db.rawUpdate(
          'UPDATE Dzongkha SET dFavourite = ? WHERE dId = ?', [favourite, id]);
    }
  }

  Future<List<FavouriteDataModel>> showFavourite() async {
    final db = await _databaseService.database;
    final List<Map<String, dynamic>> maps = await db.rawQuery(
        'SELECT * FROM (SELECT dWord AS fWord, dPhrase AS fPhrase, dFavourite AS favouroite FROM Dzongkha WHERE dFavourite !="" UNION SELECT zWord, zPhrase, zFavourite FROM Zhebsa WHERE zFavourite !="") ORDER BY 3 DESC');
    return List.generate(
        maps.length, (index) => FavouriteDataModel.fromMap(maps[index]));
  }

  Future<void> updateHistory(int id, String history, String tableName) async {
    final db = await _databaseService.database;
    if (tableName == 'Zhebsa') {
      await db.rawUpdate(
          'UPDATE Zhebsa SET zHistory = ? WHERE zId = ?', [history, id]);
    } else if (tableName == 'Dzongkha') {
      await db.rawUpdate(
          'UPDATE Dzongkha SET dHistory = ? WHERE dId = ?', [history, id]);
    }
  }

  Future<void> insertWordOfDay(ZhebsaWordOfDay zhebsaWordOfDay) async {
    final db = await _databaseService.database;
    await db.insert('ZhebsaWordOfDay', zhebsaWordOfDay.toMap(),
        conflictAlgorithm: ConflictAlgorithm.replace);
  }

  Future<List> showWordOfDay() async {
    var checkid = [];
    var dt = DateTime.now();
    String date =
        "${dt.year.toString()}-${dt.month.toString().padLeft(2, '0')}-${dt.day.toString().padLeft(2, '0')}";
    String firstDay = dt.day.toString();

    final db = await _databaseService.database;
    if (firstDay == '01') {
      // reset every month
      await db.delete('ZhebsaWordOfDay');
    }

    var check = await db.query("ZhebsaWordOfDay",
        where: 'wodDay = ?', whereArgs: [date], columns: ['wodID']);
    for (var item in check) {
      checkid.add(item['wodID']);
    }

    if (check.isEmpty) {
      var zid;
      var zhesaList = await db.rawQuery(
          'SELECT zID FROM Zhebsa WHERE zID NOT IN(SELECT wodID FROM ZhebsaWordOfDay)');
      final _random = Random();
      var wordID = zhesaList[_random.nextInt(zhesaList.length)];
      zid = wordID['zId'];
      ZhebsaWordOfDay zhebsaWordOfDay =
          ZhebsaWordOfDay(wodID: zid, wodDay: date);
      insertWordOfDay(zhebsaWordOfDay);
      checkid.add(zid);
    }

    // print(checkid);

    return getZhebsaSearch(checkid);
  }

  // Define a function that inserts Dzongkha into the database
  Future<void> insertDzongkha(Dzongkha dzongkha) async {
    final db = await _databaseService.database;

    // Insert the Dzongkha into the correct table. You might also specify the
    // `conflictAlgorithm` to use in case the same word is inserted twice.
    //
    // In this case, replace any previous data.
    await db.insert(
      'Dzongkha',
      dzongkha.toMap(),
      conflictAlgorithm: ConflictAlgorithm.replace,
    );
  }

  Future<List<Dzongkha>> showAllDzongkha() async {
    final db = await _databaseService.database;
    final List<Map<String, dynamic>> maps = await db.query('Dzongkha');
    return List.generate(maps.length, (index) => Dzongkha.fromMap(maps[index]));
  }

  Future<Dzongkha> showDzongkha(int id) async {
    final db = await _databaseService.database;
    final List<Map<String, dynamic>> maps =
        await db.query('Dzongkha', where: 'dId = ?', whereArgs: [id]);
    return Dzongkha.fromMap(maps[0]);
  }

  Future<void> updateDzongkhaFavourite(Dzongkha dzongkha) async {
    final db = await _databaseService.database;
    await db.update(
      'Dzongkha',
      dzongkha.toMap(),
      where: 'dId = ?',
      whereArgs: [dzongkha.dId],
    );
  }

  Future<void> deleteDzongkha(int id) async {
    final db = await _databaseService.database;
    await db.delete(
      'Dzongkha',
      where: 'id = ?',
      whereArgs: [id],
    );
  }

  Future<void> insertZhebsa(Zhebsa zhebsa) async {
    final db = await _databaseService.database;
    await db.insert(
      'Zhebsa',
      zhebsa.toMap(),
      conflictAlgorithm: ConflictAlgorithm.replace,
    );
  }

  Future<List<Zhebsa>> showAllZhebsa() async {
    final db = await _databaseService.database;
    final List<Map<String, dynamic>> maps = await db.query('Zhebsa');
    return List.generate(maps.length, (index) => Zhebsa.fromMap(maps[index]));
  }

  /* Future<void> updateFavouriteZhebsa(Zhebsa zhebsa) async {
    final db = await _databaseService.database;
    await db.update('Zhebsa', zhebsa.toMap(),
        where: 'zId = ?', whereArgs: [zhebsa.zId]);
  }
 */
  Future<void> deletezhebsa(int id) async {
    final db = await _databaseService.database;
    await db.delete('Zhebsa', where: 'zId = ?', whereArgs: [id]);
  }

  Future<void> insertDzongkhaZhebsa(DzongkhaZhebsa dzongkhaZhebsa) async {
    final db = await _databaseService.database;
    await db.insert(
      'DzongkhaZhebsa',
      dzongkhaZhebsa.toMap(),
      conflictAlgorithm: ConflictAlgorithm.replace,
    );
  }
}
